app/Http/Controllers/User/UserController.php

    public function home()
    {
        $pageTitle = 'Dashboard';
        $ptc       = PtcView::where('user_id', auth()->user()->id)->get(['view_date', 'amount']);

        $chart['click'] = $ptc->groupBy('view_date')->map(function ($item, $key) {
            return collect($item)->count();
        })->sort()->reverse()->take(7)->toArray();

        $chart['amount'] = $ptc->groupBy('vdt')->map(function ($item, $key) {
            return collect($item)->sum('amount');
        })->sort()->reverse()->take(7)->toArray();

        $commissionCount = CommissionLog::where('to_id', auth()->id())->sum('amount');
        $activeAdCount   = Ptc::where('status', 1)->where('user_id', auth()->id())->count();
        $user            = auth()->user();

        $referCount = User::whereRef_by(auth()->user()->id)->count();
---
select `view_date`, `amount` from `ptc_views` where `user_id` = 3
select sum(`amount`) as aggregate from `commission_logs` where `to_id` = 3
select count(*) as aggregate from `ptcs` where `status` = 1 and `user_id` = 3
select count(*) as aggregate from `users` where `ref_by` = 3

    public function userDataSubmit(Request $request)
    {
        $user = auth()->user();

        if ($user->profile_complete == Status::YES) {
            return to_route('user.home');
        }

        $request->validate([
            'firstname' => 'required',
            'lastname'  => 'required',
        ]);
        $user->firstname = $request->firstname;
        $user->lastname  = $request->lastname;
        $user->address   = [
            'country' => @$user->address->country,
            'address' => $request->address,
            'state'   => $request->state,
            'zip'     => $request->zip,
            'city'    => $request->city,
        ];
        $user->profile_complete = Status::YES;
        $user->save();
---
update `users` set `firstname` = 'Julian', `lastname` = 'William', `address` = '{\"country\":\"Afghanistan\",\"address\":\"Et enim ullam aspern\",\"state\":\"Voluptatum asperiore\",\"zip\":\"88095\",\"city\":\"Ut aut do consequatu\"}', `profile_complete` = 1, `users`.`updated_at` = '2023-09-17 22:57:34' where `id` = 3

            $transaction->details      = 'Registration Bonus';
            $transaction->remark       = 'registration_bonus';
            $transaction->trx          = getTrx();
            $transaction->save();
        }

        $plan = Plan::where('status', 1)->find($general->default_plan);
---
insert into `transactions` (`user_id`, `amount`, `post_balance`, `charge`, `trx_type`, `details`, `remark`, `trx`, `updated_at`, `created_at`) values (3, '5.00000000', 5, 0, '+', 'Registration Bonus', 'registration_bonus', 'CFWR1K768TJF', '2023-09-17 22:57:34', '2023-09-17 22:57:34')
select * from `plans` where `status` = 1 and `plans`.`id` = 0 limit 1