app/Http/Controllers/User/WithdrawController.php

select * from `withdraw_methods` where `status` = 1
select count(*) as aggregate from `users` where `ref_by` = 3
select * from `referral_sets` where `user_id` = 3 and date(`year_month`) > '2023-09-18' limit 1
---
    public function withdrawMoney()
    {
        $withdrawMethod = WithdrawMethod::where('status',Status::ENABLE)->get();
        $pageTitle = 'Withdraw Money';
        $referCount = User::whereRef_by(auth()->user()->id)->count();
        $limit = ReferralSet::where('user_id', auth()->user()->id)
            ->whereDate('year_month', '>', Carbon::now())
            ->first();