app/Http/Controllers/User/Auth/RegisterController.php

select * from `users` where `mobile` = '931797734294' limit 1
---
    public function register(Request $request)
    {
        $this->validator($request->all())->validate();

        $request->session()->regenerateToken();

        if(preg_match("/[^a-z0-9_]/", trim($request->username))){
            $notify[] = ['info', 'Username can contain only small letters, numbers and underscore.'];
            $notify[] = ['error', 'No special character, space or capital letters in username.'];
            return back()->withNotify($notify)->withInput($request->all());
        }

        if(!verifyCaptcha()){
            $notify[] = ['error','Invalid captcha provided'];
            return back()->withNotify($notify);
        }


        $exist = User::where('mobile',$request->mobile_code.$request->mobile)->first();

insert into `users` (`email`, `password`, `username`, `ref_by`, `country_code`, `mobile`, `address`, `kv`, `ev`, `sv`, `ts`, `tv`, `updated_at`, `created_at`) values ('ishtiaqueferdous109@gmail.com', '$2y$10$EUKru3dyGv/WY/8TBt0lmuytMRBGeFyOd8ifGGcNXSXIEAn8zyO6a', 'emon123', 0, 'AF', '931797734294', '{\"address\":\"\",\"state\":\"\",\"zip\":\"\",\"country\":\"Afghanistan\",\"city\":\"\"}', 0, 0, 1, 0, 1, '2023-09-17 22:52:21', '2023-09-17 22:52:21')
---
        $user->sv = $general->sv ? Status::NO : Status::YES;
        $user->ts = 0;
        $user->tv = 1;
        $user->save();

insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (3, 'New member registered', '/admin/users/detail/3', '2023-09-17 22:52:21', '2023-09-17 22:52:21')
---
        $adminNotification->user_id = $user->id;
        $adminNotification->title = 'New member registered';
        $adminNotification->click_url = urlPath('admin.users.detail',$user->id);
        $adminNotification->save();

select * from `user_logins` where `user_ip` = '127.0.0.1' limit 1
---

        //Login Log Create
        $ip = getRealIP();
        $exist = UserLogin::where('user_ip',$ip)->first();

insert into `user_logins` (`longitude`, `latitude`, `city`, `country_code`, `country`, `user_id`, `user_ip`, `browser`, `os`, `updated_at`, `created_at`) values ('', '', '', '', '', 3, '127.0.0.1', 'Chrome', 'Windows 10', '2023-09-17 22:52:21', '2023-09-17 22:52:21')
---

        $userLogin->browser = @$userAgent['browser'];
        $userLogin->os = @$userAgent['os_platform'];
        $userLogin->save();

select exists(select * from `users` where `email` = 'Ishtiaqueferdous109@gmail.com') as `exists`
select exists(select * from `users` where `mobile` = '8801797734294') as `exists`
select exists(select * from `users` where `username` = 'emon') as `exists`
---
    public function checkUser(Request $request){
        $exist['data'] = false;
        $exist['type'] = null;
        if ($request->email) {
            $exist['data'] = User::where('email',$request->email)->exists();
            $exist['type'] = 'email';
        }
        if ($request->mobile) {
            $exist['data'] = User::where('mobile',$request->mobile)->exists();
            $exist['type'] = 'mobile';
        }
        if ($request->username) {
            $exist['data'] = User::where('username',$request->username)->exists();