app/Http/Controllers/ReferController.php

select * from `users` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function index()
    {
        $users = User::with("refLimit")->orderBy('id', 'desc')->paginate(10);

select * from `referral_sets` where `referral_sets`.`user_id` in (1, 2, 3)
insert into `referral_sets` (`user_id`, `limit`, `year_month`, `updated_at`, `created_at`) values ('3', '5', '2023-10-30', '2023-09-18 00:53:15', '2023-09-18 00:53:15')
---
    public function store(Request $request)
    {
        try {
            ReferralSet::create([
               'user_id' => $request->userId,
               'limit' => $request->limit,
               'year_month' => $request->year_month,
            ]);