app/Http/Controllers/SiteController.php

select * from `pages` where `tempname` = 'templates.ptc_diamond.' and `slug` = '/' limit 1
---
    public function index()
    {
        $reference = @$_GET['reference'];

        if ($reference) {
            session()->put('reference', $reference);
        }

        $pageTitle = 'Home';
        $sections  = Page::where('tempname', $this->activeTemplate)->where('slug', '/')->first();

select * from `pages` where `tempname` = 'templates.ptc_diamond.' and `slug` = 'favicon.ico' limit 1
---
    public function pages($slug)
    {
        $page      = Page::where('tempname', $this->activeTemplate)->where('slug', $slug)->firstOrFail();