app/Http/Controllers/Admin/PlanController.php

    public function index()
    {
        $pageTitle = 'Subscription Plan';
        $levels = Referral::max('level');
        $plans = Plan::get();
---
select max(`level`) as aggregate from `referrals`
select * from `plans`